export const DEFAULT_SEO = {
  title: "Лелека медичний центр",
  description:
    'Медичний центр "Лелека" в місті Калинівка - це сімейна медицина з турботою про вас і ваших близьких',

  openGraph: {
    title: "Лелека медичний центр",
    description:
      'Медичний центр "Лелека" в місті Калинівка - це сімейна медицина з турботою про вас і ваших близьких',
    url: "https://leleka.vercel.app",
    type: "website",
    locale: "uk_UA",
    siteName: "МЦ Лелека",
    images: [
      {
        url: "https://leleka.vercel.app/family.webp",
        alt: 'Медичний центр "Лелека" в місті Калинівка - це сімейна медицина з турботою про вас і ваших близьких',
      },
    ],
  },
};
