import poboinya from "../../../public/poboinya.webp";
import gorohov from "../../../public/gorohov.webp";
import kozereva from "../../../public/kozereva.webp";

export const doctors = [
  {
    id: 1,
    photo: gorohov,
    specialist: "лікар сімейної медицини",
    name: "Горохов Володимир Вікторович",
    description:
      "Досвідчений фахівець з великим досвідом лікування дітей, якому довіряють батьки, та життєрадісним ставленням до своєї справи.",
  },
  {
    id: 2,
    photo: poboinya,
    specialist: "лікар сімейної медицини",
    name: "Побойня Олена Анатоліївна",
    description:
      "Сімейний лікар, яку справедливо цінують пацієнти за її виняткову уважність, ґрунтовні знання та досвід у лікуванні хронічних захворювань.",
  },
  {
    id: 3,
    photo: kozereva,
    specialist: "лікар ультразвукової діагностики",
    name: "Козирева Оксана Вікторівна",
    description:
      " Завдяки надзвичайній уважності, ретельному підходу та невпинному навчанню, наш лікар УЗД забезпечує максимально точну діагностику.",
  },
];
