import React from "react";
import cl from "./agree.module.scss";
import Link from "next/link";

export default function UserAgree() {
  return (
    <div className={cl.wrapAgree}>
      <article className={cl.agreement}>
        <h2>Публічний договір про надання медичних послуг</h2>
        <ul className={cl.list}>
          <li className={cl.point}>1. Загальні положення</li>
          <li className={cl.text}>
            Визначення: Даний документ є публічною офертою (пропозицією) ТОВ
            "Коперія", код ЄДРПОУ 42395137, IBAN UA373052990000026006006100246
            (надалі — Виконавець) для будь-якої фізичної особи (надалі —
            Пацієнт/Користувач).
          </li>
          <li className={cl.text}>
            Акцепт: Оплата послуг через систему LiqPay на сайті або натискання
            кнопки «Оплатити» вважається повним і безумовним прийняттям умов
            цього Договору.
          </li>
          <li className={cl.point}>2. Предмет договору</li>
          <li className={cl.text}>
            Виконавець зобов’язується надати медичні послуги згідно з переліком
            (Прайсом), обраним Користувачем на сайті, а Користувач — оплатити
            їх.
          </li>
          <li className={cl.text}>
            Послуги надаються відповідно до ліцензії, виданої згідно Наказу МОЗ
            України від 17.08.2020 №1879 Про ліцензування медичної практики
          </li>
          <li className={cl.point}>3. Порядок надання та оплата послуг</li>
          <li className={cl.text}>
            Запис на послугу здійснюється через сайт або за телефоном до моменту
            оплати.
          </li>
          <li className={cl.text}>
            Медична послуга, яка надається за один візит Пацієнта, підлягає
            оплаті після надання послуги. Медична послуга, яка передбачає
            декілька візитів, підлягає оплаті під час першого відвідування.
          </li>
          <li className={cl.text}>
            Медична послуга вважається наданою після фактичного візиту або
            візитів пацієнта до закладу.
          </li>
          <li className={cl.point}>4. Порядок оплати через LiqPay</li>
          <li className={cl.text}>
            Ціна: Вартість послуг вказується у національній валюті (Гривня).
          </li>
          <li className={cl.text}>
            Процес: Оплата здійснюється шляхом безготівкового переказу через
            платіжну систему LiqPay.
          </li>
          <li className={cl.text}>
            Підтвердження: Після успішної транзакції Користувач отримує
            електронне підтвердження на вказану e-mail адресу.
          </li>
          <li className={cl.text}>
            Комісія: Виконавець не несе відповідальності за додаткові комісії
            банків-емітентів.
          </li>
          <li className={cl.point}>5. Політика повернення коштів</li>
          <li className={cl.text}>
            Неможливість надання: У разі неможливості надання послуги з
            технічних або інших причин (відсутність світла, хвороба спеціаліста
            тощо), Виконавець пропонує перенесення візиту або здійснює повне
            повернення коштів.
          </li>
          <li className={cl.text}>
            Процедура: Для повернення коштів Користувач має подати письмову
            заяву на електронну пошту koperiya.mc@gmail.com.
          </li>
          <li className={cl.text}>
            Зверніть увагу: При поверненні коштів комісія платіжної системи
            LiqPay (якщо вона була утримана під час транзакції) може не
            повертатися Користувачу, якщо це передбачено правилами платіжного
            сервісу.
          </li>
          <li className={cl.point}>6. Конфіденційність та захист даних</li>
          <li className={cl.text}>
            Медичний заклад зобов’язується зберігати медичну таємницю.
          </li>
          <li className={cl.text}>
            Користувач дає згоду на обробку персональних даних згідно із Законом
            України «Про захист персональних даних» для забезпечення фінансових
            розрахунків та надання меддопомоги.
          </li>
        </ul>
      </article>
      <Link href="/payment" className={cl.linkPay}>
        Повернутись на сторінку оплати
      </Link>
    </div>
  );
}
