import React from "react";
import cl from "./agree.module.scss";
import Link from "next/link";

export default function UserAgree() {
  return (
    <div className={cl.wrapAgree}>
      <article className={cl.agreement}>
        <h2>Публічний договір про надання медичних послуг</h2>
        <ul className={cl.list}>
          <li className={cl.text}>
            Цей договір є офіційною та публічною пропозицією Надавача послуг
            укласти договір про надання та оплату медичних послуг,
            представленого на сайті https://leleka.vercel.app/. Даний договір є
            публічним, тобто відповідно до статті 633 Цивільного кодексу
            України, його умови є однаковими для всіх отримувачів послуг
            незалежно від їх статусу (фізична особа, юридична особа, фізична
            особа-підприємець) без надання переваги одному покупцю перед іншим.
            Шляхом укладення цього Договору отримувач послуг в повному обсязі
            приймає умови та порядок надання послуг та оплати послуг. Договір
            вважається укладеним з моменту натискання кнопки «Перейти до оплати»
            на голвній сторінці в розділі «Скринінг здоров'я 40+».
          </li>
          <li className={cl.point}>1. Визначення термінів</li>
          <li className={cl.text}>
            1.1. Публічна оферта (далі - «Оферта») - публічна пропозиція
            Надавача послуг, адресована невизначеному колу осіб, укласти з
            Надавачем договір надання медичних послуг на умовах, що містяться в
            цій Оферті.
          </li>
          <li className={cl.text}>
            1.2. Медична послуга – об'єкт угоди сторін, надається в медичному
            закладі "Лелека", за адресою місто Калинівка Вінницької області,
            вул.Костянтина Васюка 15-А, та передбачає присутність пацієнта .
          </li>
          <li className={cl.text}>
            1.3. Сайт Надавача послг за адресою https://leleka.vercel.app/
            створений для ознайомлення Пацієнта із запропонованим переліком
            послуг, запису на прийом, та оплати за допомогою мережі
            Інтернет.{" "}
          </li>
          <li className={cl.text}>
            1.4. Надавач послуг – Товариство з обмеженою відповідальністю
            «Коперія» (код ЄДРПОУ 42395137), юридична особа, яка створена і діє
            відповідно до чинного законодавства України, місцезнаходження якої:
            22400; м.Калинівка, вул. Медична, буд.3.
          </li>
          <li className={cl.point}>2. Предмет Договору</li>
          <li className={cl.text}>
            2.1. Виконавець зобов’язується надати медичні послуги Пацієнту, а
            Пацієнт зобов’язується оплатити надані послуги на умовах цього
            Договору.
          </li>
          <li className={cl.text}>
            2.2. Послуги надаються відповідно до ліцензії, виданої згідно Наказу
            МОЗ України від 17.08.2020 №1879 Про ліцензування медичної практики
          </li>
          <li className={cl.point}>
            3. Порядок надання та оплати медичних послуг
          </li>
          <li className={cl.text}>
            3.1. Для отримання медичної послуги бажано записатись на прийом
            через сайт або за телефоном, вказаним на сайті.
          </li>
          <li className={cl.text}>
            3.2. Медична послуга, яка надається за один візит Пацієнта, підлягає
            оплаті після надання послуги. Медична послуга, яка передбачає
            декілька візитів, підлягає оплаті під час першого відвідування.
            Вартість послуг вказується у національній валюті (Гривня).
          </li>
          <li className={cl.text}>
            3.3. Оплата здійснюється шляхом безготівкового переказу через
            платіжну систему LiqPay. Після успішної транзакції Користувач
            отримує електронне підтвердження на вказану e-mail адресу.
            Виконавець не несе відповідальності за додаткові комісії
            банків-емітентів.
          </li>
          <li className={cl.text}>
            3.4. Медична послуга вважається наданою після фактичного візиту або
            візитів пацієнта до лікаря в межах однієї послуги.
          </li>
          <li className={cl.point}>4. Повернення грошових коштів</li>
          <li className={cl.text}>
            4.1. У разі неможливості надання послуги з технічних або інших
            причин (відсутність світла, хвороба спеціаліста тощо), Виконавець
            пропонує перенесення візиту або здійснює повне повернення коштів.
          </li>
          <li className={cl.text}>
            4.2. Для повернення коштів Користувач має подати письмову заяву на
            електронну пошту koperiya.mc@gmail.com.
          </li>
          <li className={cl.text}>
            4.3. При поверненні коштів комісія платіжної системи LiqPay (якщо
            вона була утримана під час транзакції) може не повертатися
            Користувачу, якщо це передбачено правилами платіжного сервісу.
          </li>
          <li className={cl.point}>5. Права ті обов’язки Сторін</li>
          <li className={cl.text}>5.1. Виконавець зобов’язаний: </li>
          <li className={cl.text}>
            5.1.1. Надати медичну послугу у відповідності до умов цього Договору
            та замовлення Пацієнта.
          </li>
          <li className={cl.text}>
            5.1.2. Не розголошувати будь-яку приватну інформацію про Пацієнтаа і
            не надавати доступ до цієї інформації третім особам, за винятком
            випадків, передбачених законодавством та під час виконання
            Замовлення Покупця.
          </li>
          <li className={cl.text}>5.2. Виконавець має право: </li>
          <li className={cl.text}>
            5.2.1 Змінювати умови цього Договору, а також ціни на медичні
            послуги, в односторонньому порядку, розміщуючи їх на сайті закладу.
            Всі зміни набувають чинності з моменту їх публікації.
          </li>
          <li className={cl.text}>5.3 Пацєнт зобов'язується: </li>
          <li className={cl.text}>
            5.3.1 До моменту укладення Договору ознайомитися зі змістом
            Договору, умовами Договору і цінами, запропонованими на сайті.
          </li>
          <li className={cl.point}>
            6. Конфіденційність і захист персональних даних.
          </li>
          <li className={cl.text}>
            6.1. Сайт Виконавця https://leleka.vercel.app/ не збирає і не
            зберігає персональні дані Користувача. Натискаючи кнопку "Перейти до
            оплати", Користувач перенапрвляється на сторінку оплати платіжної
            системи LiqPay.
          </li>
          <li className={cl.text}>
            6.2. На сторінці оплати платіжної системи LiqPay, натискаючи кнопку
            "Оплатити" Користувач надає LiqPay свою добровільну згоду на
            обробку, використання (у тому числі і передачу) своїх персональних
            даних, а також вчинення інших дій, передбачених Законом України «Про
            захист персональних даних», без обмеження терміну дії такої згоди.
          </li>
          <li className={cl.point}>7. Інші умови</li>
          <li className={cl.text}>
            7.1. Цей договір укладено на території України і діє відповідно до
            чинного законодавства України.
          </li>
          <li className={cl.text}>
            7.2. Усі спори, що виникають між Пацієнтом і Виконавцем, вирішуються
            шляхом переговорів. У випадку недосягнення врегулювання спірного
            питання шляхом переговорів, Пацієнт та/або Виконавцем мають право
            звернутися за вирішенням спору до судових органів відповідно до
            чинного законодавства України.
          </li>
          <li className={cl.text}>
            7.3. Виконавець має право вносити зміни до цього Договору в
            односторонньому порядку, передбаченому п. 5.2.1. Договору. Крім
            того, зміни до Договору також можуть бути внесені за взаємною згодою
            Сторін в порядку, передбаченому чинним законодавством України.
          </li>
          <li className={cl.point}>АДРЕСА ТА РЕКВІЗИТИ ВИКОНАВЦЯ:</li>
          <li className={cl.text}>ТОВ «Коперія» Код ЄДРПОУ 42395137</li>
          <li className={cl.text}>22400, м. Калинівка, вул. Медична, буд. 3</li>
          <li className={cl.text}>п/р UA373052990000026006006100246 </li>
          <li className={cl.text}>в КБ АТ «Приватбанк»</li>
          <li className={cl.text}>ІПН 423951302075 св. ПДВ 1802074500046</li>
          <li className={cl.text}>тел. (067) 791-29-09</li>
        </ul>
      </article>
      <Link href="/" className={cl.linkPay}>
        Повернутись на головну сторінку
      </Link>
    </div>
  );
}
