import Link from "next/link";
import React from "react";
import cl from "./rules.module.scss";

export default function Rules() {
  return (
    <div className={cl.wrapRules}>
      <div className={cl.wrapCase}>
        <article className={cl.article}>
          <h3>Реєстрація та правила роботи в Кабінеті пацієнта</h3>
          <p className={cl.remark}>
            Це ваш зручний онлайн-сервіс для взаємодії з нашим медичним
            закладом.
          </p>
        </article>
      </div>
      <div className={cl.wrapCase}>
        <article className={cl.article}>
          <h3>Реєстрація в Кабінеті пацієнта</h3>
          <p className={cl.remark}>
            Зареєструватися в Кабінеті пацієнта можуть як нові пацієнти, що ще
            ніколи не зверталися до нас, так і ті, хто вже має історію візитів.
          </p>
          <h4>Для нових пацієнтів:</h4>
          <p>
            Процес реєстрації дуже простий: вам потрібно вказати своє прізвище,
            ім'я, по батькові та номер телефону.
          </p>
          <h4>Для пацієнтів, які вже відвідували наш заклад:</h4>
          <p>
            Вам також необхідно вказати прізвище, ім'я, по батькові та номер
            телефону. Дуже важливо, щоб зазначений вами номер телефону
            відповідав тому номеру, який вже є в нашій медичній базі даних. Якщо
            номер не збігатиметься, верифікація не відбудеться. Під час
            реєстрації система шукає вас у базі даних і здійснює дзвінок на той
            номер телефону, який вже збережено в ній, а не на той, що ви вказали
            при реєстрації. Це забезпечує безпеку ваших даних.
          </p>
        </article>
      </div>
      <div className={cl.wrapCase}>
        <article className={cl.article}>
          <h3>Доступні можливості Кабінету пацієнта</h3>
          <p className={cl.remark}>
            Після успішної реєстрації вам стануть доступні такі функції:
          </p>
          <h4>Онлайн-запис на прийом:</h4>
          <p>
            Ви можете легко записатися до лікаря у зручний для вас час, не
            виходячи з дому.
          </p>
          <h4>Електронні направлення та рецепти:</h4>
          <p>
            Кабінет пацієнта дозволяє переглядати ваші електронні направлення та
            рецепти.
          </p>
          <h4>Додавання пов'язаних осіб:</h4>
          <p>
            Ви маєте можливість додати до свого облікового запису профілі
            пов'язаних осіб, що дозволить зручно керувати їхніми записами та
            даними (наприклад, для дітей або літніх родичів).
          </p>
          <h4>Доступ до медичної документації:</h4>
          <p>
            Щоб отримати доступ до ваших медичних документів (результатів
            аналізів та обстежень, проведених у нашому закладі), вам необхідно
            звернутися до адміністратора за телефоном або написати запит на
            Вайбер або Телеграм. Адміністратор надасть вам спеціальний код
            доступу. Введіть цей код у відповідне віконце у вашому Кабінеті
            пацієнта, і ви отримаєте повний доступ до своєї медичної історії.
          </p>
        </article>
      </div>
      <div className={cl.wrapCase}>
        <div className={cl.rulesLink}>
          <Link href="/" className={cl.link}>
            На головну сторінку
          </Link>
          <a
            href="https://medportal.ua/#/?misCode=LEL"
            target="_blank"
            rel="noopener noreferrer"
            className={cl.link}
          >
            На портал пацієнта
          </a>
        </div>
      </div>
    </div>
  );
}
